###################################################################

# Created by write_sdc on Fri Sep 23 08:57:32 2016

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_operating_conditions -max ss0p95v125c -max_library saed32rvt_ss0p95v125c -min ff1p16v125c -min_library saed32rvt_ff1p16v125c
set_load -pin_load 10 [get_ports scan_en]
set_load -pin_load 10 [get_ports test_mode]
set_load -pin_load 10 [get_ports pll_bypass]
set_load -pin_load 10 [get_ports power_save]
set_load -pin_load 2 [get_ports sys_clk]
set_load -pin_load 2 [get_ports pclk]
set_load -pin_load 2 [get_ports prst_n]
set_load -pin_load 15 [get_ports pidsel]
set_load -pin_load 15 [get_ports pgnt_n]
set_load -pin_load 15 [get_ports {pad[15]}]
set_load -pin_load 15 [get_ports {pad[14]}]
set_load -pin_load 15 [get_ports {pad[13]}]
set_load -pin_load 15 [get_ports {pad[12]}]
set_load -pin_load 15 [get_ports {pad[11]}]
set_load -pin_load 15 [get_ports {pad[10]}]
set_load -pin_load 15 [get_ports {pad[9]}]
set_load -pin_load 15 [get_ports {pad[8]}]
set_load -pin_load 15 [get_ports {pad[7]}]
set_load -pin_load 15 [get_ports {pad[6]}]
set_load -pin_load 15 [get_ports {pad[5]}]
set_load -pin_load 15 [get_ports {pad[4]}]
set_load -pin_load 15 [get_ports {pad[3]}]
set_load -pin_load 15 [get_ports {pad[2]}]
set_load -pin_load 15 [get_ports {pad[1]}]
set_load -pin_load 15 [get_ports {pad[0]}]
set_load -pin_load 15 [get_ports ppar]
set_load -pin_load 15 [get_ports {pc_be[3]}]
set_load -pin_load 15 [get_ports {pc_be[2]}]
set_load -pin_load 15 [get_ports {pc_be[1]}]
set_load -pin_load 15 [get_ports {pc_be[0]}]
set_load -pin_load 15 [get_ports pframe_n]
set_load -pin_load 15 [get_ports ptrdy_n]
set_load -pin_load 15 [get_ports pirdy_n]
set_load -pin_load 15 [get_ports pdevsel_n]
set_load -pin_load 15 [get_ports pstop_n]
set_load -pin_load 15 [get_ports pperr_n]
set_load -pin_load 15 [get_ports pserr_n]
set_load -pin_load 15 [get_ports preq_n]
set_load -pin_load 15 [get_ports pm66en]
set_load -pin_load 2 [get_ports sdr_clk]
set_load -pin_load 5 [get_ports sd_CK]
set_load -pin_load 5 [get_ports sd_CKn]
set_load -pin_load 20 [get_ports {sd_DQ[15]}]
set_load -pin_load 20 [get_ports {sd_DQ[14]}]
set_load -pin_load 20 [get_ports {sd_DQ[13]}]
set_load -pin_load 20 [get_ports {sd_DQ[12]}]
set_load -pin_load 20 [get_ports {sd_DQ[11]}]
set_load -pin_load 20 [get_ports {sd_DQ[10]}]
set_load -pin_load 20 [get_ports {sd_DQ[9]}]
set_load -pin_load 20 [get_ports {sd_DQ[8]}]
set_load -pin_load 20 [get_ports {sd_DQ[7]}]
set_load -pin_load 20 [get_ports {sd_DQ[6]}]
set_load -pin_load 20 [get_ports {sd_DQ[5]}]
set_load -pin_load 20 [get_ports {sd_DQ[4]}]
set_load -pin_load 20 [get_ports {sd_DQ[3]}]
set_load -pin_load 20 [get_ports {sd_DQ[2]}]
set_load -pin_load 20 [get_ports {sd_DQ[1]}]
set_load -pin_load 20 [get_ports {sd_DQ[0]}]
set_load -pin_load 20 [get_ports {sd_A[9]}]
set_load -pin_load 20 [get_ports {sd_A[8]}]
set_load -pin_load 20 [get_ports {sd_A[7]}]
set_load -pin_load 20 [get_ports {sd_A[6]}]
set_load -pin_load 20 [get_ports {sd_A[5]}]
set_load -pin_load 20 [get_ports {sd_A[4]}]
set_load -pin_load 20 [get_ports {sd_A[3]}]
set_load -pin_load 20 [get_ports {sd_A[2]}]
set_load -pin_load 20 [get_ports {sd_A[1]}]
set_load -pin_load 20 [get_ports {sd_A[0]}]
set_load -pin_load 20 [get_ports {sd_BWS[1]}]
set_load -pin_load 20 [get_ports {sd_BWS[0]}]
set_load -pin_load 20 [get_ports sd_LD]
set_load -pin_load 20 [get_ports sd_RW]
set_max_fanout 20 [get_ports scan_en]
set_max_fanout 20 [get_ports test_mode]
set_max_fanout 20 [get_ports pll_bypass]
set_max_fanout 20 [get_ports power_save]
set_max_fanout 20 [get_ports sys_clk]
set_max_fanout 20 [get_ports pclk]
set_max_fanout 20 [get_ports prst_n]
set_max_fanout 20 [get_ports pidsel]
set_max_fanout 20 [get_ports pgnt_n]
set_max_fanout 20 [get_ports {pad[15]}]
set_max_fanout 20 [get_ports {pad[14]}]
set_max_fanout 20 [get_ports {pad[13]}]
set_max_fanout 20 [get_ports {pad[12]}]
set_max_fanout 20 [get_ports {pad[11]}]
set_max_fanout 20 [get_ports {pad[10]}]
set_max_fanout 20 [get_ports {pad[9]}]
set_max_fanout 20 [get_ports {pad[8]}]
set_max_fanout 20 [get_ports {pad[7]}]
set_max_fanout 20 [get_ports {pad[6]}]
set_max_fanout 20 [get_ports {pad[5]}]
set_max_fanout 20 [get_ports {pad[4]}]
set_max_fanout 20 [get_ports {pad[3]}]
set_max_fanout 20 [get_ports {pad[2]}]
set_max_fanout 20 [get_ports {pad[1]}]
set_max_fanout 20 [get_ports {pad[0]}]
set_max_fanout 20 [get_ports ppar]
set_max_fanout 20 [get_ports {pc_be[3]}]
set_max_fanout 20 [get_ports {pc_be[2]}]
set_max_fanout 20 [get_ports {pc_be[1]}]
set_max_fanout 20 [get_ports {pc_be[0]}]
set_max_fanout 20 [get_ports pframe_n]
set_max_fanout 20 [get_ports ptrdy_n]
set_max_fanout 20 [get_ports pirdy_n]
set_max_fanout 20 [get_ports pdevsel_n]
set_max_fanout 20 [get_ports pstop_n]
set_max_fanout 20 [get_ports pperr_n]
set_max_fanout 20 [get_ports pserr_n]
set_max_fanout 20 [get_ports pm66en]
set_max_fanout 20 [get_ports sdr_clk]
set_max_fanout 20 [get_ports {sd_DQ[15]}]
set_max_fanout 20 [get_ports {sd_DQ[14]}]
set_max_fanout 20 [get_ports {sd_DQ[13]}]
set_max_fanout 20 [get_ports {sd_DQ[12]}]
set_max_fanout 20 [get_ports {sd_DQ[11]}]
set_max_fanout 20 [get_ports {sd_DQ[10]}]
set_max_fanout 20 [get_ports {sd_DQ[9]}]
set_max_fanout 20 [get_ports {sd_DQ[8]}]
set_max_fanout 20 [get_ports {sd_DQ[7]}]
set_max_fanout 20 [get_ports {sd_DQ[6]}]
set_max_fanout 20 [get_ports {sd_DQ[5]}]
set_max_fanout 20 [get_ports {sd_DQ[4]}]
set_max_fanout 20 [get_ports {sd_DQ[3]}]
set_max_fanout 20 [get_ports {sd_DQ[2]}]
set_max_fanout 20 [get_ports {sd_DQ[1]}]
set_max_fanout 20 [get_ports {sd_DQ[0]}]
set_case_analysis 0 [get_ports scan_en]
set_case_analysis 0 [get_ports test_mode]
set_case_analysis 0 [get_ports pll_bypass]
set_case_analysis 0 [get_ports power_save]
set_case_analysis 1 [get_ports pm66en]
set_ideal_network [get_ports scan_en]
set_ideal_network [get_pins I_CLK_SOURCE_SDRAM_CLK/Y]
set_ideal_network [get_pins I_CLK_SOURCE_SYS_2x_CLK/Y]
set_ideal_network [get_pins I_CLK_SOURCE_SYS_CLK/Y]
set_ideal_network [get_pins I_CLK_SOURCE_PCLK/Y]
set_ideal_network -no_propagate  [get_pins I_RESET_BLOCK/U7/Y]
set_ideal_network -no_propagate  [get_pins I_RESET_BLOCK/U14/Y]
set_ideal_network -no_propagate  [get_pins I_RESET_BLOCK/U13/Y]
set_ideal_network -no_propagate  [get_pins I_RESET_BLOCK/U12/Y]
set_ideal_network [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_CKn/Y]
set_ideal_network [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_CK/Y]
set_ideal_network [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_0/Y]
set_ideal_network [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_1/Y]
set_ideal_network [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_2/Y]
set_ideal_network [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_3/Y]
set_ideal_network [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_4/Y]
set_ideal_network [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_5/Y]
set_ideal_network [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_6/Y]
set_ideal_network [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_7/Y]
set_ideal_network [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_8/Y]
set_ideal_network [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_9/Y]
set_ideal_network [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_10/Y]
set_ideal_network [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_11/Y]
set_ideal_network [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_12/Y]
set_ideal_network [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_13/Y]
set_ideal_network [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_14/Y]
set_ideal_network [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_15/Y]
create_clock [get_ports pclk]  -period 15  -waveform {0 7.5}
set_max_capacitance 150 [get_clocks pclk]
create_clock [get_ports sys_clk]  -period 4  -waveform {0 2}
set_max_capacitance 150 [get_clocks sys_clk]
create_clock [get_ports sdr_clk]  -period 7.5  -waveform {0 3.75}
set_max_capacitance 150 [get_clocks sdr_clk]
create_generated_clock [get_pins I_CLOCK_GEN/I_PLL_PCI/CLK_1X]  -name PCI_CLK  -source [get_pins I_CLOCK_GEN/I_PLL_PCI/REF_CLK]  -divide_by 2
set_clock_uncertainty -setup 0.3  [get_clocks PCI_CLK]
set_max_capacitance 150 [get_clocks PCI_CLK]
create_generated_clock [get_pins I_CLOCK_GEN/I_PLL_SD/CLK_1X]  -name SDRAM_CLK  -source [get_pins I_CLOCK_GEN/I_PLL_SD/REF_CLK]  -multiply_by 1
set_clock_uncertainty -setup 0.1  [get_clocks SDRAM_CLK]
set_max_capacitance 150 [get_clocks SDRAM_CLK]
create_generated_clock [get_ports sd_CK]  -name SD_DDR_CLK  -source [get_pins I_CLOCK_GEN/I_PLL_SD/CLK_1X]  -divide_by 1
set_clock_latency 2  [get_clocks SD_DDR_CLK]
set_max_capacitance 150 [get_clocks SD_DDR_CLK]
create_generated_clock [get_pins I_CLOCK_GEN/I_CLKMUL/CLK_1X]  -name SYS_CLK  -source [get_pins I_CLOCK_GEN/I_CLKMUL/REF_CLK]  -multiply_by 1
set_clock_uncertainty -setup 0.2  [get_clocks SYS_CLK]
set_max_capacitance 150 [get_clocks SYS_CLK]
create_generated_clock [get_pins I_CLOCK_GEN/I_CLKMUL/CLK_2X]  -name SYS_2x_CLK  -source [get_pins I_CLOCK_GEN/I_CLKMUL/REF_CLK]  -multiply_by 2
set_clock_uncertainty -setup 0.2  [get_clocks SYS_2x_CLK]
set_max_capacitance 150 [get_clocks SYS_2x_CLK]
group_path -name INS  -from [list [get_ports scan_en] [get_ports test_mode] [get_ports pll_bypass] [get_ports power_save] [get_ports sys_clk] [get_ports pclk] [get_ports prst_n] [get_ports pidsel] [get_ports pgnt_n] [get_ports {pad[15]}] [get_ports {pad[14]}] [get_ports {pad[13]}] [get_ports {pad[12]}] [get_ports {pad[11]}] [get_ports {pad[10]}] [get_ports {pad[9]}] [get_ports {pad[8]}] [get_ports {pad[7]}] [get_ports {pad[6]}] [get_ports {pad[5]}] [get_ports {pad[4]}] [get_ports {pad[3]}] [get_ports {pad[2]}] [get_ports {pad[1]}] [get_ports {pad[0]}] [get_ports ppar] [get_ports {pc_be[3]}] [get_ports {pc_be[2]}] [get_ports {pc_be[1]}] [get_ports {pc_be[0]}] [get_ports pframe_n] [get_ports ptrdy_n] [get_ports pirdy_n] [get_ports pdevsel_n] [get_ports pstop_n] [get_ports pperr_n] [get_ports pserr_n] [get_ports pm66en] [get_ports sdr_clk] [get_ports {sd_DQ[15]}] [get_ports {sd_DQ[14]}] [get_ports {sd_DQ[13]}] [get_ports {sd_DQ[12]}] [get_ports {sd_DQ[11]}] [get_ports {sd_DQ[10]}] [get_ports {sd_DQ[9]}] [get_ports {sd_DQ[8]}] [get_ports {sd_DQ[7]}] [get_ports {sd_DQ[6]}] [get_ports {sd_DQ[5]}] [get_ports {sd_DQ[4]}] [get_ports {sd_DQ[3]}] [get_ports {sd_DQ[2]}] [get_ports {sd_DQ[1]}] [get_ports {sd_DQ[0]}]]
group_path -name OUTS  -to [list [get_ports {pad[15]}] [get_ports {pad[14]}] [get_ports {pad[13]}] [get_ports {pad[12]}] [get_ports {pad[11]}] [get_ports {pad[10]}] [get_ports {pad[9]}] [get_ports {pad[8]}] [get_ports {pad[7]}] [get_ports {pad[6]}] [get_ports {pad[5]}] [get_ports {pad[4]}] [get_ports {pad[3]}] [get_ports {pad[2]}] [get_ports {pad[1]}] [get_ports {pad[0]}] [get_ports ppar] [get_ports {pc_be[3]}] [get_ports {pc_be[2]}] [get_ports {pc_be[1]}] [get_ports {pc_be[0]}] [get_ports pframe_n] [get_ports ptrdy_n] [get_ports pirdy_n] [get_ports pdevsel_n] [get_ports pstop_n] [get_ports pperr_n] [get_ports pserr_n] [get_ports preq_n] [get_ports sd_CK] [get_ports sd_CKn] [get_ports {sd_DQ[15]}] [get_ports {sd_DQ[14]}] [get_ports {sd_DQ[13]}] [get_ports {sd_DQ[12]}] [get_ports {sd_DQ[11]}] [get_ports {sd_DQ[10]}] [get_ports {sd_DQ[9]}] [get_ports {sd_DQ[8]}] [get_ports {sd_DQ[7]}] [get_ports {sd_DQ[6]}] [get_ports {sd_DQ[5]}] [get_ports {sd_DQ[4]}] [get_ports {sd_DQ[3]}] [get_ports {sd_DQ[2]}] [get_ports {sd_DQ[1]}] [get_ports {sd_DQ[0]}] [get_ports {sd_A[9]}] [get_ports {sd_A[8]}] [get_ports {sd_A[7]}] [get_ports {sd_A[6]}] [get_ports {sd_A[5]}] [get_ports {sd_A[4]}] [get_ports {sd_A[3]}] [get_ports {sd_A[2]}] [get_ports {sd_A[1]}] [get_ports {sd_A[0]}] [get_ports {sd_BWS[1]}] [get_ports {sd_BWS[0]}] [get_ports sd_LD] [get_ports sd_RW]]
set_input_delay -clock PCI_CLK  -max 4  [get_ports scan_en]
set_input_delay -clock PCI_CLK  -min 2  [get_ports scan_en]
set_input_delay -clock PCI_CLK  -max 4  [get_ports test_mode]
set_input_delay -clock PCI_CLK  -min 2  [get_ports test_mode]
set_input_delay -clock PCI_CLK  -max 4  [get_ports pll_bypass]
set_input_delay -clock PCI_CLK  -min 2  [get_ports pll_bypass]
set_input_delay -clock PCI_CLK  -max 4  [get_ports power_save]
set_input_delay -clock PCI_CLK  -min 2  [get_ports power_save]
set_input_delay -clock PCI_CLK  2  [get_ports pidsel]
set_input_delay -clock PCI_CLK  2  [get_ports pgnt_n]
set_input_delay -clock PCI_CLK  2  [get_ports {pad[15]}]
set_input_delay -clock PCI_CLK  2  [get_ports {pad[14]}]
set_input_delay -clock PCI_CLK  2  [get_ports {pad[13]}]
set_input_delay -clock PCI_CLK  2  [get_ports {pad[12]}]
set_input_delay -clock PCI_CLK  2  [get_ports {pad[11]}]
set_input_delay -clock PCI_CLK  2  [get_ports {pad[10]}]
set_input_delay -clock PCI_CLK  2  [get_ports {pad[9]}]
set_input_delay -clock PCI_CLK  2  [get_ports {pad[8]}]
set_input_delay -clock PCI_CLK  2  [get_ports {pad[7]}]
set_input_delay -clock PCI_CLK  2  [get_ports {pad[6]}]
set_input_delay -clock PCI_CLK  2  [get_ports {pad[5]}]
set_input_delay -clock PCI_CLK  2  [get_ports {pad[4]}]
set_input_delay -clock PCI_CLK  2  [get_ports {pad[3]}]
set_input_delay -clock PCI_CLK  2  [get_ports {pad[2]}]
set_input_delay -clock PCI_CLK  2  [get_ports {pad[1]}]
set_input_delay -clock PCI_CLK  2  [get_ports {pad[0]}]
set_input_delay -clock PCI_CLK  2  [get_ports ppar]
set_input_delay -clock PCI_CLK  2  [get_ports {pc_be[3]}]
set_input_delay -clock PCI_CLK  2  [get_ports {pc_be[2]}]
set_input_delay -clock PCI_CLK  2  [get_ports {pc_be[1]}]
set_input_delay -clock PCI_CLK  2  [get_ports {pc_be[0]}]
set_input_delay -clock PCI_CLK  2  [get_ports pframe_n]
set_input_delay -clock PCI_CLK  2  [get_ports ptrdy_n]
set_input_delay -clock PCI_CLK  2  [get_ports pirdy_n]
set_input_delay -clock PCI_CLK  2  [get_ports pdevsel_n]
set_input_delay -clock PCI_CLK  2  [get_ports pstop_n]
set_input_delay -clock PCI_CLK  2  [get_ports pperr_n]
set_input_delay -clock PCI_CLK  2  [get_ports pserr_n]
set_input_delay -clock PCI_CLK  2  [get_ports pm66en]
set_input_delay -clock SDRAM_CLK  -max 0.8  [get_ports {sd_DQ[15]}]
set_input_delay -clock SDRAM_CLK  -min 0.2  [get_ports {sd_DQ[15]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -max 0.8  -add_delay  [get_ports {sd_DQ[15]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -min 0.2  -add_delay  [get_ports {sd_DQ[15]}]
set_input_delay -clock SDRAM_CLK  -max 0.8  [get_ports {sd_DQ[14]}]
set_input_delay -clock SDRAM_CLK  -min 0.2  [get_ports {sd_DQ[14]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -max 0.8  -add_delay  [get_ports {sd_DQ[14]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -min 0.2  -add_delay  [get_ports {sd_DQ[14]}]
set_input_delay -clock SDRAM_CLK  -max 0.8  [get_ports {sd_DQ[13]}]
set_input_delay -clock SDRAM_CLK  -min 0.2  [get_ports {sd_DQ[13]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -max 0.8  -add_delay  [get_ports {sd_DQ[13]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -min 0.2  -add_delay  [get_ports {sd_DQ[13]}]
set_input_delay -clock SDRAM_CLK  -max 0.8  [get_ports {sd_DQ[12]}]
set_input_delay -clock SDRAM_CLK  -min 0.2  [get_ports {sd_DQ[12]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -max 0.8  -add_delay  [get_ports {sd_DQ[12]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -min 0.2  -add_delay  [get_ports {sd_DQ[12]}]
set_input_delay -clock SDRAM_CLK  -max 0.8  [get_ports {sd_DQ[11]}]
set_input_delay -clock SDRAM_CLK  -min 0.2  [get_ports {sd_DQ[11]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -max 0.8  -add_delay  [get_ports {sd_DQ[11]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -min 0.2  -add_delay  [get_ports {sd_DQ[11]}]
set_input_delay -clock SDRAM_CLK  -max 0.8  [get_ports {sd_DQ[10]}]
set_input_delay -clock SDRAM_CLK  -min 0.2  [get_ports {sd_DQ[10]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -max 0.8  -add_delay  [get_ports {sd_DQ[10]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -min 0.2  -add_delay  [get_ports {sd_DQ[10]}]
set_input_delay -clock SDRAM_CLK  -max 0.8  [get_ports {sd_DQ[9]}]
set_input_delay -clock SDRAM_CLK  -min 0.2  [get_ports {sd_DQ[9]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -max 0.8  -add_delay  [get_ports {sd_DQ[9]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -min 0.2  -add_delay  [get_ports {sd_DQ[9]}]
set_input_delay -clock SDRAM_CLK  -max 0.8  [get_ports {sd_DQ[8]}]
set_input_delay -clock SDRAM_CLK  -min 0.2  [get_ports {sd_DQ[8]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -max 0.8  -add_delay  [get_ports {sd_DQ[8]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -min 0.2  -add_delay  [get_ports {sd_DQ[8]}]
set_input_delay -clock SDRAM_CLK  -max 0.8  [get_ports {sd_DQ[7]}]
set_input_delay -clock SDRAM_CLK  -min 0.2  [get_ports {sd_DQ[7]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -max 0.8  -add_delay  [get_ports {sd_DQ[7]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -min 0.2  -add_delay  [get_ports {sd_DQ[7]}]
set_input_delay -clock SDRAM_CLK  -max 0.8  [get_ports {sd_DQ[6]}]
set_input_delay -clock SDRAM_CLK  -min 0.2  [get_ports {sd_DQ[6]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -max 0.8  -add_delay  [get_ports {sd_DQ[6]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -min 0.2  -add_delay  [get_ports {sd_DQ[6]}]
set_input_delay -clock SDRAM_CLK  -max 0.8  [get_ports {sd_DQ[5]}]
set_input_delay -clock SDRAM_CLK  -min 0.2  [get_ports {sd_DQ[5]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -max 0.8  -add_delay  [get_ports {sd_DQ[5]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -min 0.2  -add_delay  [get_ports {sd_DQ[5]}]
set_input_delay -clock SDRAM_CLK  -max 0.8  [get_ports {sd_DQ[4]}]
set_input_delay -clock SDRAM_CLK  -min 0.2  [get_ports {sd_DQ[4]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -max 0.8  -add_delay  [get_ports {sd_DQ[4]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -min 0.2  -add_delay  [get_ports {sd_DQ[4]}]
set_input_delay -clock SDRAM_CLK  -max 0.8  [get_ports {sd_DQ[3]}]
set_input_delay -clock SDRAM_CLK  -min 0.2  [get_ports {sd_DQ[3]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -max 0.8  -add_delay  [get_ports {sd_DQ[3]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -min 0.2  -add_delay  [get_ports {sd_DQ[3]}]
set_input_delay -clock SDRAM_CLK  -max 0.8  [get_ports {sd_DQ[2]}]
set_input_delay -clock SDRAM_CLK  -min 0.2  [get_ports {sd_DQ[2]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -max 0.8  -add_delay  [get_ports {sd_DQ[2]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -min 0.2  -add_delay  [get_ports {sd_DQ[2]}]
set_input_delay -clock SDRAM_CLK  -max 0.8  [get_ports {sd_DQ[1]}]
set_input_delay -clock SDRAM_CLK  -min 0.2  [get_ports {sd_DQ[1]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -max 0.8  -add_delay  [get_ports {sd_DQ[1]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -min 0.2  -add_delay  [get_ports {sd_DQ[1]}]
set_input_delay -clock SDRAM_CLK  -max 0.8  [get_ports {sd_DQ[0]}]
set_input_delay -clock SDRAM_CLK  -min 0.2  [get_ports {sd_DQ[0]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -max 0.8  -add_delay  [get_ports {sd_DQ[0]}]
set_input_delay -clock SDRAM_CLK  -clock_fall  -min 0.2  -add_delay  [get_ports {sd_DQ[0]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pad[15]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pad[15]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pad[14]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pad[14]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pad[13]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pad[13]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pad[12]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pad[12]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pad[11]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pad[11]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pad[10]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pad[10]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pad[9]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pad[9]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pad[8]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pad[8]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pad[7]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pad[7]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pad[6]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pad[6]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pad[5]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pad[5]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pad[4]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pad[4]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pad[3]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pad[3]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pad[2]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pad[2]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pad[1]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pad[1]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pad[0]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pad[0]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports ppar]
set_output_delay -clock PCI_CLK  -min -1  [get_ports ppar]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pc_be[3]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pc_be[3]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pc_be[2]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pc_be[2]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pc_be[1]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pc_be[1]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports {pc_be[0]}]
set_output_delay -clock PCI_CLK  -min -1  [get_ports {pc_be[0]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports pframe_n]
set_output_delay -clock PCI_CLK  -min -1  [get_ports pframe_n]
set_output_delay -clock PCI_CLK  -max 4  [get_ports ptrdy_n]
set_output_delay -clock PCI_CLK  -min -1  [get_ports ptrdy_n]
set_output_delay -clock PCI_CLK  -max 4  [get_ports pirdy_n]
set_output_delay -clock PCI_CLK  -min -1  [get_ports pirdy_n]
set_output_delay -clock PCI_CLK  -max 4  [get_ports pdevsel_n]
set_output_delay -clock PCI_CLK  -min -1  [get_ports pdevsel_n]
set_output_delay -clock PCI_CLK  -max 4  [get_ports pstop_n]
set_output_delay -clock PCI_CLK  -min -1  [get_ports pstop_n]
set_output_delay -clock PCI_CLK  -max 4  [get_ports pperr_n]
set_output_delay -clock PCI_CLK  -min -1  [get_ports pperr_n]
set_output_delay -clock PCI_CLK  -max 4  [get_ports pserr_n]
set_output_delay -clock PCI_CLK  -min -1  [get_ports pserr_n]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_DQ[15]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_DQ[15]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -max 0.75  -add_delay  [get_ports {sd_DQ[15]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -min -0.1  -add_delay  [get_ports {sd_DQ[15]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_DQ[14]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_DQ[14]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -max 0.75  -add_delay  [get_ports {sd_DQ[14]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -min -0.1  -add_delay  [get_ports {sd_DQ[14]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_DQ[13]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_DQ[13]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -max 0.75  -add_delay  [get_ports {sd_DQ[13]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -min -0.1  -add_delay  [get_ports {sd_DQ[13]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_DQ[12]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_DQ[12]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -max 0.75  -add_delay  [get_ports {sd_DQ[12]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -min -0.1  -add_delay  [get_ports {sd_DQ[12]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_DQ[11]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_DQ[11]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -max 0.75  -add_delay  [get_ports {sd_DQ[11]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -min -0.1  -add_delay  [get_ports {sd_DQ[11]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_DQ[10]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_DQ[10]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -max 0.75  -add_delay  [get_ports {sd_DQ[10]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -min -0.1  -add_delay  [get_ports {sd_DQ[10]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_DQ[9]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_DQ[9]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -max 0.75  -add_delay  [get_ports {sd_DQ[9]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -min -0.1  -add_delay  [get_ports {sd_DQ[9]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_DQ[8]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_DQ[8]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -max 0.75  -add_delay  [get_ports {sd_DQ[8]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -min -0.1  -add_delay  [get_ports {sd_DQ[8]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_DQ[7]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_DQ[7]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -max 0.75  -add_delay  [get_ports {sd_DQ[7]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -min -0.1  -add_delay  [get_ports {sd_DQ[7]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_DQ[6]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_DQ[6]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -max 0.75  -add_delay  [get_ports {sd_DQ[6]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -min -0.1  -add_delay  [get_ports {sd_DQ[6]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_DQ[5]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_DQ[5]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -max 0.75  -add_delay  [get_ports {sd_DQ[5]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -min -0.1  -add_delay  [get_ports {sd_DQ[5]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_DQ[4]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_DQ[4]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -max 0.75  -add_delay  [get_ports {sd_DQ[4]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -min -0.1  -add_delay  [get_ports {sd_DQ[4]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_DQ[3]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_DQ[3]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -max 0.75  -add_delay  [get_ports {sd_DQ[3]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -min -0.1  -add_delay  [get_ports {sd_DQ[3]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_DQ[2]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_DQ[2]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -max 0.75  -add_delay  [get_ports {sd_DQ[2]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -min -0.1  -add_delay  [get_ports {sd_DQ[2]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_DQ[1]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_DQ[1]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -max 0.75  -add_delay  [get_ports {sd_DQ[1]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -min -0.1  -add_delay  [get_ports {sd_DQ[1]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_DQ[0]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_DQ[0]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -max 0.75  -add_delay  [get_ports {sd_DQ[0]}]
set_output_delay -clock SD_DDR_CLK  -clock_fall  -min -0.1  -add_delay  [get_ports {sd_DQ[0]}]
set_output_delay -clock PCI_CLK  -max 4  [get_ports preq_n]
set_output_delay -clock PCI_CLK  -min -1  [get_ports preq_n]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_A[9]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_A[9]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_A[8]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_A[8]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_A[7]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_A[7]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_A[6]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_A[6]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_A[5]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_A[5]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_A[4]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_A[4]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_A[3]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_A[3]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_A[2]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_A[2]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_A[1]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_A[1]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_A[0]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_A[0]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_BWS[1]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_BWS[1]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports {sd_BWS[0]}]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports {sd_BWS[0]}]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports sd_LD]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports sd_LD]
set_output_delay -clock SD_DDR_CLK  -max 0.75  [get_ports sd_RW]
set_output_delay -clock SD_DDR_CLK  -min -0.1  [get_ports sd_RW]
set_input_transition -max 0.5  [get_ports scan_en]
set_input_transition -min 0.5  [get_ports scan_en]
set_input_transition -max 0.5  [get_ports test_mode]
set_input_transition -min 0.5  [get_ports test_mode]
set_input_transition -max 0.5  [get_ports pll_bypass]
set_input_transition -min 0.5  [get_ports pll_bypass]
set_input_transition -max 0.5  [get_ports power_save]
set_input_transition -min 0.5  [get_ports power_save]
set_input_transition -max 0.5  [get_ports sys_clk]
set_input_transition -min 0.5  [get_ports sys_clk]
set_input_transition -max 0.5  [get_ports pclk]
set_input_transition -min 0.5  [get_ports pclk]
set_input_transition -max 0.5  [get_ports prst_n]
set_input_transition -min 0.5  [get_ports prst_n]
set_input_transition -max 1  [get_ports pidsel]
set_input_transition -min 1  [get_ports pidsel]
set_input_transition -max 1  [get_ports pgnt_n]
set_input_transition -min 1  [get_ports pgnt_n]
set_input_transition -max 1  [get_ports {pad[15]}]
set_input_transition -min 1  [get_ports {pad[15]}]
set_input_transition -max 1  [get_ports {pad[14]}]
set_input_transition -min 1  [get_ports {pad[14]}]
set_input_transition -max 1  [get_ports {pad[13]}]
set_input_transition -min 1  [get_ports {pad[13]}]
set_input_transition -max 1  [get_ports {pad[12]}]
set_input_transition -min 1  [get_ports {pad[12]}]
set_input_transition -max 1  [get_ports {pad[11]}]
set_input_transition -min 1  [get_ports {pad[11]}]
set_input_transition -max 1  [get_ports {pad[10]}]
set_input_transition -min 1  [get_ports {pad[10]}]
set_input_transition -max 1  [get_ports {pad[9]}]
set_input_transition -min 1  [get_ports {pad[9]}]
set_input_transition -max 1  [get_ports {pad[8]}]
set_input_transition -min 1  [get_ports {pad[8]}]
set_input_transition -max 1  [get_ports {pad[7]}]
set_input_transition -min 1  [get_ports {pad[7]}]
set_input_transition -max 1  [get_ports {pad[6]}]
set_input_transition -min 1  [get_ports {pad[6]}]
set_input_transition -max 1  [get_ports {pad[5]}]
set_input_transition -min 1  [get_ports {pad[5]}]
set_input_transition -max 1  [get_ports {pad[4]}]
set_input_transition -min 1  [get_ports {pad[4]}]
set_input_transition -max 1  [get_ports {pad[3]}]
set_input_transition -min 1  [get_ports {pad[3]}]
set_input_transition -max 1  [get_ports {pad[2]}]
set_input_transition -min 1  [get_ports {pad[2]}]
set_input_transition -max 1  [get_ports {pad[1]}]
set_input_transition -min 1  [get_ports {pad[1]}]
set_input_transition -max 1  [get_ports {pad[0]}]
set_input_transition -min 1  [get_ports {pad[0]}]
set_input_transition -max 1  [get_ports ppar]
set_input_transition -min 1  [get_ports ppar]
set_input_transition -max 1  [get_ports {pc_be[3]}]
set_input_transition -min 1  [get_ports {pc_be[3]}]
set_input_transition -max 1  [get_ports {pc_be[2]}]
set_input_transition -min 1  [get_ports {pc_be[2]}]
set_input_transition -max 1  [get_ports {pc_be[1]}]
set_input_transition -min 1  [get_ports {pc_be[1]}]
set_input_transition -max 1  [get_ports {pc_be[0]}]
set_input_transition -min 1  [get_ports {pc_be[0]}]
set_input_transition -max 1  [get_ports pframe_n]
set_input_transition -min 1  [get_ports pframe_n]
set_input_transition -max 1  [get_ports ptrdy_n]
set_input_transition -min 1  [get_ports ptrdy_n]
set_input_transition -max 1  [get_ports pirdy_n]
set_input_transition -min 1  [get_ports pirdy_n]
set_input_transition -max 1  [get_ports pdevsel_n]
set_input_transition -min 1  [get_ports pdevsel_n]
set_input_transition -max 1  [get_ports pstop_n]
set_input_transition -min 1  [get_ports pstop_n]
set_input_transition -max 1  [get_ports pperr_n]
set_input_transition -min 1  [get_ports pperr_n]
set_input_transition -max 1  [get_ports pserr_n]
set_input_transition -min 1  [get_ports pserr_n]
set_input_transition -max 1  [get_ports pm66en]
set_input_transition -min 1  [get_ports pm66en]
set_input_transition -max 0.5  [get_ports sdr_clk]
set_input_transition -min 0.5  [get_ports sdr_clk]
set_input_transition -max 0.5  [get_ports {sd_DQ[15]}]
set_input_transition -min 0.5  [get_ports {sd_DQ[15]}]
set_input_transition -max 0.5  [get_ports {sd_DQ[14]}]
set_input_transition -min 0.5  [get_ports {sd_DQ[14]}]
set_input_transition -max 0.5  [get_ports {sd_DQ[13]}]
set_input_transition -min 0.5  [get_ports {sd_DQ[13]}]
set_input_transition -max 0.5  [get_ports {sd_DQ[12]}]
set_input_transition -min 0.5  [get_ports {sd_DQ[12]}]
set_input_transition -max 0.5  [get_ports {sd_DQ[11]}]
set_input_transition -min 0.5  [get_ports {sd_DQ[11]}]
set_input_transition -max 0.5  [get_ports {sd_DQ[10]}]
set_input_transition -min 0.5  [get_ports {sd_DQ[10]}]
set_input_transition -max 0.5  [get_ports {sd_DQ[9]}]
set_input_transition -min 0.5  [get_ports {sd_DQ[9]}]
set_input_transition -max 0.5  [get_ports {sd_DQ[8]}]
set_input_transition -min 0.5  [get_ports {sd_DQ[8]}]
set_input_transition -max 0.5  [get_ports {sd_DQ[7]}]
set_input_transition -min 0.5  [get_ports {sd_DQ[7]}]
set_input_transition -max 0.5  [get_ports {sd_DQ[6]}]
set_input_transition -min 0.5  [get_ports {sd_DQ[6]}]
set_input_transition -max 0.5  [get_ports {sd_DQ[5]}]
set_input_transition -min 0.5  [get_ports {sd_DQ[5]}]
set_input_transition -max 0.5  [get_ports {sd_DQ[4]}]
set_input_transition -min 0.5  [get_ports {sd_DQ[4]}]
set_input_transition -max 0.5  [get_ports {sd_DQ[3]}]
set_input_transition -min 0.5  [get_ports {sd_DQ[3]}]
set_input_transition -max 0.5  [get_ports {sd_DQ[2]}]
set_input_transition -min 0.5  [get_ports {sd_DQ[2]}]
set_input_transition -max 0.5  [get_ports {sd_DQ[1]}]
set_input_transition -min 0.5  [get_ports {sd_DQ[1]}]
set_input_transition -max 0.5  [get_ports {sd_DQ[0]}]
set_input_transition -min 0.5  [get_ports {sd_DQ[0]}]
set_clock_gating_check -low -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_0/A1]
set_clock_gating_check -low -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_0/A1]
set_clock_gating_check -low -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_0/A1]
set_clock_gating_check -low -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_0/A1]
set_clock_gating_check -high -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_0/A2]
set_clock_gating_check -high -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_0/A2]
set_clock_gating_check -high -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_0/A2]
set_clock_gating_check -high -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_0/A2]
set_clock_gating_check -low -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_1/A1]
set_clock_gating_check -low -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_1/A1]
set_clock_gating_check -low -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_1/A1]
set_clock_gating_check -low -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_1/A1]
set_clock_gating_check -high -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_1/A2]
set_clock_gating_check -high -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_1/A2]
set_clock_gating_check -high -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_1/A2]
set_clock_gating_check -high -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_1/A2]
set_clock_gating_check -low -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_2/A1]
set_clock_gating_check -low -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_2/A1]
set_clock_gating_check -low -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_2/A1]
set_clock_gating_check -low -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_2/A1]
set_clock_gating_check -high -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_2/A2]
set_clock_gating_check -high -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_2/A2]
set_clock_gating_check -high -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_2/A2]
set_clock_gating_check -high -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_2/A2]
set_clock_gating_check -low -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_3/A1]
set_clock_gating_check -low -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_3/A1]
set_clock_gating_check -low -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_3/A1]
set_clock_gating_check -low -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_3/A1]
set_clock_gating_check -high -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_3/A2]
set_clock_gating_check -high -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_3/A2]
set_clock_gating_check -high -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_3/A2]
set_clock_gating_check -high -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_3/A2]
set_clock_gating_check -low -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_4/A1]
set_clock_gating_check -low -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_4/A1]
set_clock_gating_check -low -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_4/A1]
set_clock_gating_check -low -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_4/A1]
set_clock_gating_check -high -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_4/A2]
set_clock_gating_check -high -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_4/A2]
set_clock_gating_check -high -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_4/A2]
set_clock_gating_check -high -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_4/A2]
set_clock_gating_check -low -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_5/A1]
set_clock_gating_check -low -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_5/A1]
set_clock_gating_check -low -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_5/A1]
set_clock_gating_check -low -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_5/A1]
set_clock_gating_check -high -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_5/A2]
set_clock_gating_check -high -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_5/A2]
set_clock_gating_check -high -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_5/A2]
set_clock_gating_check -high -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_5/A2]
set_clock_gating_check -low -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_6/A1]
set_clock_gating_check -low -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_6/A1]
set_clock_gating_check -low -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_6/A1]
set_clock_gating_check -low -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_6/A1]
set_clock_gating_check -high -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_6/A2]
set_clock_gating_check -high -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_6/A2]
set_clock_gating_check -high -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_6/A2]
set_clock_gating_check -high -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_6/A2]
set_clock_gating_check -low -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_7/A1]
set_clock_gating_check -low -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_7/A1]
set_clock_gating_check -low -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_7/A1]
set_clock_gating_check -low -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_7/A1]
set_clock_gating_check -high -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_7/A2]
set_clock_gating_check -high -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_7/A2]
set_clock_gating_check -high -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_7/A2]
set_clock_gating_check -high -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_7/A2]
set_clock_gating_check -low -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_8/A1]
set_clock_gating_check -low -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_8/A1]
set_clock_gating_check -low -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_8/A1]
set_clock_gating_check -low -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_8/A1]
set_clock_gating_check -high -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_8/A2]
set_clock_gating_check -high -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_8/A2]
set_clock_gating_check -high -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_8/A2]
set_clock_gating_check -high -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_8/A2]
set_clock_gating_check -low -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_9/A1]
set_clock_gating_check -low -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_9/A1]
set_clock_gating_check -low -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_9/A1]
set_clock_gating_check -low -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_9/A1]
set_clock_gating_check -high -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_9/A2]
set_clock_gating_check -high -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_9/A2]
set_clock_gating_check -high -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_9/A2]
set_clock_gating_check -high -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_9/A2]
set_clock_gating_check -low -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_10/A1]
set_clock_gating_check -low -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_10/A1]
set_clock_gating_check -low -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_10/A1]
set_clock_gating_check -low -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_10/A1]
set_clock_gating_check -high -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_10/A2]
set_clock_gating_check -high -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_10/A2]
set_clock_gating_check -high -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_10/A2]
set_clock_gating_check -high -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_10/A2]
set_clock_gating_check -low -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_11/A1]
set_clock_gating_check -low -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_11/A1]
set_clock_gating_check -low -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_11/A1]
set_clock_gating_check -low -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_11/A1]
set_clock_gating_check -high -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_11/A2]
set_clock_gating_check -high -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_11/A2]
set_clock_gating_check -high -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_11/A2]
set_clock_gating_check -high -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_11/A2]
set_clock_gating_check -low -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_12/A1]
set_clock_gating_check -low -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_12/A1]
set_clock_gating_check -low -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_12/A1]
set_clock_gating_check -low -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_12/A1]
set_clock_gating_check -high -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_12/A2]
set_clock_gating_check -high -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_12/A2]
set_clock_gating_check -high -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_12/A2]
set_clock_gating_check -high -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_12/A2]
set_clock_gating_check -low -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_13/A1]
set_clock_gating_check -low -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_13/A1]
set_clock_gating_check -low -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_13/A1]
set_clock_gating_check -low -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_13/A1]
set_clock_gating_check -high -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_13/A2]
set_clock_gating_check -high -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_13/A2]
set_clock_gating_check -high -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_13/A2]
set_clock_gating_check -high -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_13/A2]
set_clock_gating_check -low -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_14/A1]
set_clock_gating_check -low -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_14/A1]
set_clock_gating_check -low -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_14/A1]
set_clock_gating_check -low -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_14/A1]
set_clock_gating_check -high -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_14/A2]
set_clock_gating_check -high -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_14/A2]
set_clock_gating_check -high -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_14/A2]
set_clock_gating_check -high -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_14/A2]
set_clock_gating_check -low -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_15/A1]
set_clock_gating_check -low -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_15/A1]
set_clock_gating_check -low -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_15/A1]
set_clock_gating_check -low -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_15/A1]
set_clock_gating_check -high -rise -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_15/A2]
set_clock_gating_check -high -fall -setup 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_15/A2]
set_clock_gating_check -high -rise -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_15/A2]
set_clock_gating_check -high -fall -hold 0 [get_pins I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_mux_dq_out_15/A2]
